renesas-rx/rx65n-envision-kit/rx65n_envisionkit/benchmark/rx65n_envision_kit_demo/src/smc_gen/r_t4_ftp_server_rx/src/r_ftp_server.c
/******************************************************************************
Private global variables and functions
******************************************************************************/
static const uint8_t user_data[MAX_USER][16] = {USER_LIST};
static const uint8_t pass_data[MAX_USER][16] = {PASS_LIST};
static const uint8_t root_dir[MAX_USER][16]  = {ROOT_DIR_LIST};

static ER ftp_rcv_request(ID cepid, uint8_t *buf, int16_t buf_len, ER rcv_dat_size);
static ER strcat_with_check_len(uint8_t *src, uint8_t *concat, int32_t size);

static int16_t cmdline(int8_t *buf, int16_t *argc, int8_t **argv);

static int16_t ftps_retr(int16_t argc, int8_t **argv, ID cepid);
static int16_t ftps_port(int16_t argc, int8_t **argv, ID cepid);
static int16_t ftps_pasv(int16_t argc, int8_t **argv, ID cepid);
static int16_t ftps_user(int16_t argc, int8_t **argv, ID cepid);
static int16_t ftps_pass(int16_t argc, int8_t **argv, ID cepid);
static int16_t ftps_type(int16_t argc, int8_t **argv, ID cepid);
static int16_t ftps_quit(int16_t argc, int8_t **argv, ID cepid);
static int16_t ftps_noop(int16_t argc, int8_t **argv, ID cepid);
static int16_t ftps_stor(int16_t argc, int8_t **argv, ID cepid);
static int16_t ftps_list_nlst(int16_t argc, int8_t **argv, ID cepid);
static int16_t ftps_rnto(int16_t argc, int8_t **argv, ID cepid);
static int16_t ftps_rnfr(int16_t argc, int8_t **argv, ID cepid);
static int16_t ftps_dele(int16_t argc, int8_t **argv, ID cepid);
static int16_t ftps_cwd(int16_t argc, int8_t **argv, ID cepid);
static int16_t ftps_pwd(int16_t argc, int8_t **argv, ID cepid);
static int16_t ftps_mkd(int16_t argc, int8_t **argv, ID cepid);
static int16_t ftps_rmd(int16_t argc, int8_t **argv, ID cepid);
static int16_t ftps_cdup(int16_t argc, int8_t **argv, ID cepid);
static int16_t ftps_abor(int16_t argc, int8_t **argv, ID cepid);
static int16_t non_support_cmd(ID cepid, int8_t *argv);
static int16_t ftps_list_nlst_dataport(ID cepid);
static int16_t ftps_list_nlst_finish(ID cepid);
static int16_t ftps_stor_dataport(ID cepid, int32_t rcv_len);
static int16_t ftps_stor_finish(ID cepid);
static int16_t ftps_retr_dataport(ID cepid);
static int16_t ftps_retr_finish(ID cepid);
static void ftps_abor_finish(ID cepid);
static int32_t stricmp_rx(const uint8_t *s1, const uint8_t *s2, int32_t count);
static int32_t path_concatenate(ID cepid , uint8_t *buf, uint32_t buf_len, uint8_t *path);

ER ftp_callback(ID cepid, FN fncd , VP p_parblk);
ER ftp_data_callback(ID cepid, FN fncd , VP p_parblk);

/*------------ GLOBAL -----------*/

/******************************************************************************
Exported global variables and functions (to be accessed by other files)
******************************************************************************/
FTP_CEP  ftp_cep[FTP_TCP_CEP_NUM];
_FTP_STAT ftp_stat[FTP_TCP_CEP_NUM/2];

/******************************************************************************
Imported global variables and functions (from other files)
******************************************************************************/
extern char _T4_Version[];
//extern const H __tcpcepn;
//extern T_TCP_CCEP tcp_ccep[];
extern T_TCP_CREP tcp_crep[];
//extern const H __tcprepn;
extern TCPUDP_ENV tcpudp_env[];

uint8_t far *ftps_cmd_tbl[]
= { "STOR", "RETR", "PASV", "ABOR",
    "USER", "PASS", "TYPE", "PWD", "XPWD", "CWD", "CDUP", "QUIT", "DELE",
    "PORT", "LIST", "NLST", "MKD", "XMKD",
    "RMD", "XRMD",  "RNFR", "RNTO", "NOOP",
    NULL
  };
int16_t (*ftps_cmd_exe[])(int16_t, int8_t **, ID cepid)
= { ftps_stor, ftps_retr, ftps_pasv, ftps_abor,
    ftps_user, ftps_pass, ftps_type, ftps_pwd, ftps_pwd, ftps_cwd, ftps_cdup, ftps_quit, ftps_dele,
    ftps_port, ftps_list_nlst, ftps_list_nlst, ftps_mkd, ftps_mkd,
    ftps_rmd, ftps_rmd, ftps_rnfr, ftps_rnto, ftps_noop,
  };

/*------------ PROCESS -----------*/

/******************************************************************************
* Function Name : R_ftp_srv_open
* Description   : Start the FTP server.
* Argument      : none
* Return Value  : none
******************************************************************************/
void R_ftp_srv_open(uint8_t *ipaddr)
{
    int16_t loop;
    int32_t ip_work;

    memset(ftp_cep, 0, sizeof(ftp_cep));
    memset(ftp_stat, 0, sizeof(ftp_stat));

    ip_work = ((uint32_t)ipaddr[0] << 24) + ((uint32_t)ipaddr[1] << 16) + ((uint32_t)ipaddr[2] << 8) + (uint32_t)ipaddr[3];

    for (loop = 0; loop < FTP_TCP_CEP_NUM; loop++)
    {
        ftp_cep[loop].myaddr.ipaddr = ip_work;
        if ((loop % 2) == 1)
        {
            ftp_cep[loop].buff_ptr = ftp_stat[loop/2].data_buff;
            ftp_cep[loop].myaddr.portno = 20;  /* Port number */
        }
        else
        {
            ftp_cep[loop].buff_ptr = ftp_stat[loop/2].cmd_buff;
            ftp_cep[loop].myaddr.portno = 21;  /* Port number */
        }
    }
    return;
}

void R_ftp_srv_ip_address_update(uint8_t *ipaddr)
{
    int16_t loop;
	int32_t ip_work;

    ip_work = ((uint32_t)ipaddr[0] << 24) + ((uint32_t)ipaddr[1] << 16) + ((uint32_t)ipaddr[2] << 8) + (uint32_t)ipaddr[3];

    for (loop = 0; loop < FTP_TCP_CEP_NUM; loop++)
    {
        ftp_cep[loop].myaddr.ipaddr = ip_work;
    }

}

/******************************************************************************
* Function Name : R_ftpd
* Description   : Check the FTP server status.
* Argument      : none
* Return Value  : none
******************************************************************************/
void R_ftpd(void)
{
    ER   ercd;
    int32_t i;
    int32_t ip_work;

    if (0 != (FTP_START_TCP_CEP % 2))
    {
        while (1); /* System Error!! */
    }

    /* checks the state of all communication endpoints */
    for (i = 0; i < FTP_TCP_CEP_NUM; i += 2)
    {
        switch (ftp_cep[i].status)
        {
            case FTP_CLOSED:
                /* accept */
                ercd = tcp_acp_cep(i + FTP_START_TCP_CEP + 1, i + FTP_START_TCP_CEP + 1, &(ftp_cep[i].dstaddr), TMO_NBLK);
                if (ercd != E_WBLK)
                {
                    while (1);
                }
                ftp_cep[i].status = FTP_ACCEPT;
                break;
            default:
                break;
        }
    }

