renesas-rx/rx65n-envision-kit/rx65n_envisionkit/benchmark/rx65n_envision_kit_demo/src/smc_gen/r_t4_ftp_server_rx/src/r_ftp_server.c
static int16_t ftps_list_nlst_finish(ID cepid)
{
    _FTP_STAT *pftpstat;
    FTP_CEP   *pcep;

    pftpstat =  &ftp_stat[(cepid-1)/2];
    pcep  =  &ftp_cep[cepid-1];

    if (pftpstat->exec_command_subseq != FTP_DATA_LIST_SUBSEQ16)
    {
        pcep->remain_data = sprintf((char *)(ftp_cep[cepid-1].buff_ptr), MSG_EXEC_ERROR);
    }
    else
    {
        pcep->remain_data = sprintf((char *)(ftp_cep[cepid-1].buff_ptr), MSG_TRNS_CMPLT);
    }

    pftpstat->exec_command = FTP_DATA_NONE;
    pftpstat->exec_command_subseq = 0;

    pcep->remain_data = strlen((const char *)pcep->buff_ptr);

    return (0);
}


static int16_t ftps_port(int16_t argc, int8_t **argv, ID cepid)
{
    int16_t   ip0, ip1, ip2, ip3, port0, port1;
    FTP_CEP   *cmd_pcep;
    FTP_CEP   *data_pcep;
    _FTP_STAT *pftpstat;

    cmd_pcep = (&ftp_cep[cepid-1]);
    data_pcep = (&ftp_cep[cepid]);
    pftpstat = (&ftp_stat[(cepid-1)/2]);

    pftpstat->rnfr = 0;
    if (cmd_pcep->status < FTP_LOGIN)
    {
        cmd_pcep->remain_data = sprintf((char *)(cmd_pcep->buff_ptr), MSG_NOT_AVAILABLE);
        cmd_pcep->status = FTP_CLOSING;
        return (-1);
    }

    if (argc != 2)
    {
        cmd_pcep->remain_data = sizeof(MSG_PARAM_ERROR) - 1;
        strcpy((char *)(cmd_pcep->buff_ptr), MSG_PARAM_ERROR);
        return (-1);
    }

    sscanf((char*)argv[1], "%hd,%hd,%hd,%hd,%hd,%hd", &ip0, &ip1, &ip2, &ip3, &port0, &port1);
    data_pcep->dstaddr.ipaddr = ((uint32_t)ip0 << 24) + ((uint32_t)ip1 << 16)
                                + ((uint32_t)ip2 << 8) + (uint32_t)ip3;
    data_pcep->dstaddr.portno = port0 * 256 + port1;  /* Port number */

    data_pcep->myaddr.portno = 20;  /* Port number */

    pftpstat->valid_dstaddr = 1;

    /* The making of the command normal end message */
    cmd_pcep->remain_data = sprintf((char *)(cmd_pcep->buff_ptr), MSG_CMD_ACCEPTED, "PORT");
    pftpstat->exec_command = FTP_DATA_PORT;
    return (0);

}


static int16_t ftps_pasv(int16_t argc, int8_t **argv, ID cepid)
{
    uint16_t   ip0, ip1, ip2, ip3, port0, port1;
    uint32_t  ip_work, port_work;
    ER      ercd;
    FTP_CEP   *cmd_pcep;
    FTP_CEP   *data_pcep;
    _FTP_STAT *pftpstat;

    if (0 != (FTP_START_TCP_CEP % 2))
    {
        while (1); /* System Error!! */
    }

    cmd_pcep = (&ftp_cep[cepid-1]);
    data_pcep = (&ftp_cep[cepid]);
    pftpstat = (&ftp_stat[(cepid-1)/2]);

    pftpstat->rnfr = 0;
    if (cmd_pcep->status < FTP_LOGIN)
    {
        cmd_pcep->remain_data = sprintf((char *)(cmd_pcep->buff_ptr), MSG_NOT_AVAILABLE);
        cmd_pcep->status = FTP_CLOSING;
        return (-1);
    }

    ip_work = cmd_pcep->myaddr.ipaddr;
    data_pcep->myaddr.portno = (1024 + cepid + FTP_START_TCP_CEP);
    tcp_crep[cepid + FTP_START_TCP_CEP].myaddr.portno = (1024 + cepid + FTP_START_TCP_CEP);
    port_work = data_pcep->myaddr.portno;

    ip0 = (uint16_t)((ip_work >> 24) % 256);
    ip1 = (uint16_t)((ip_work >> 16) % 256);
    ip2 = (uint16_t)((ip_work >> 8) % 256);
    ip3 = (uint16_t)(ip_work % 256);
    port0 = (uint16_t)(port_work / 256);
    port1 = (uint16_t)(port_work % 256);

    /* generate normal end message */
    cmd_pcep->remain_data = sprintf((char *)(cmd_pcep->buff_ptr), MSG_PASV_RES, ip0, ip1, ip2, ip3, port0, port1);
    ercd = tcp_acp_cep(cepid + FTP_START_TCP_CEP + 1, cepid + FTP_START_TCP_CEP + 1, &(data_pcep->dstaddr), TMO_NBLK);
    if (ercd != E_WBLK)
    {
        return (-1);
    }

    return (0);

}



static int16_t ftps_quit(int16_t argc, int8_t **argv, ID cepid)
{

    ftp_stat[(cepid-1)/2].rnfr = 0;
    ftp_cep[cepid-1].remain_data = sizeof(MSG_GOODBY) - 1;
    strcpy((char *)(ftp_cep[cepid-1].buff_ptr), MSG_GOODBY);

    return (0);
}


static int16_t ftps_noop(int16_t argc, int8_t **argv, ID cepid)
{
    ftp_stat[(cepid-1)/2].rnfr = 0;
    if (ftp_cep[cepid-1].status < FTP_LOGIN)
    {
        ftp_cep[cepid-1].remain_data = sprintf((char *)(ftp_cep[cepid-1].buff_ptr), MSG_NOT_AVAILABLE);
        ftp_cep[cepid-1].status = FTP_CLOSING;
        return (-1);
    }

    /* generate normal end message */
    ftp_cep[cepid-1].remain_data = sprintf((char *)(ftp_cep[cepid-1].buff_ptr), MSG_CMD_SUCCESS, "NOOP");

    return (0);
}


static int16_t ftps_retr(int16_t argc, int8_t **argv, ID cepid)
{

    int32_t file_index;
    _FTP_STAT *pftpstat;
    FTP_CEP   *pcep;
    uint8_t  tmp_buf[512];

    pftpstat =  &ftp_stat[(cepid-1)/2];
    pcep  =  &ftp_cep[cepid-1];

    pftpstat->rnfr = 0;
    if (pcep->status < FTP_LOGIN)
    {
        pcep->remain_data = sprintf((char *)(pcep->buff_ptr), MSG_NOT_AVAILABLE);
        pcep->status = FTP_CLOSING;
        return (-1);
    }

    pftpstat->exec_command = FTP_DATA_RETR;
    pftpstat->exec_command_subseq = FTP_DATA_RETR_SUBSEQ04;
    pftpstat->read_crlf_check = 0;

    if (argc != 2)
    {
        pcep->remain_data = sizeof(MSG_PARAM_ERROR) - 1;
        strcpy((char *)(pcep->buff_ptr), MSG_PARAM_ERROR);
        pftpstat->exec_command_subseq = FTP_DATA_SUBSEQ_ERR;
        return -1;
    }

    if (0 != path_concatenate(cepid , tmp_buf, sizeof(tmp_buf), (uint8_t *)argv[1]))
    {
        pcep->remain_data = sizeof(MSG_EXEC_ERROR) - 1;
        strcpy((char *)(pcep->buff_ptr), MSG_EXEC_ERROR);
        pftpstat->exec_command_subseq = FTP_DATA_SUBSEQ_ERR;
        return -1;
    }

    file_index = file_open((uint8_t *)tmp_buf, FILE_READ);
    if (file_index < 0)
    {
        pcep->remain_data = sizeof(MSG_NO_SUCH_FILE) - 1;
        strcpy((char *)(pcep->buff_ptr), MSG_NO_SUCH_FILE);
        pftpstat->exec_command_subseq = FTP_DATA_SUBSEQ_ERR;
        return -1;
    }
    else
    {
        pftpstat->file_index = file_index;
        if (pftpstat->trans_mode == 'A')
        {
            pcep->remain_data = sprintf((char *)(pcep->buff_ptr), MSG_OPEN_DATA_CON, "ASCII");
        }
        else
        {
            pcep->remain_data = sprintf((char *)(pcep->buff_ptr), MSG_OPEN_DATA_CON, "IMAGE");
        }
    }

    return (0);
}


