renesas-rx/rx65n-envision-kit/rx65n_envisionkit/benchmark/rx65n_envision_kit_demo/src/smc_gen/r_t4_ftp_server_rx/src/r_ftp_server.c
static int16_t ftps_retr_dataport(ID cepid)
{
    int32_t i, sizeret;
    int32_t flag;
    int32_t readsize;

    _FTP_STAT *pftpstat;
    FTP_CEP   *pcep;

    pftpstat =  &ftp_stat[(cepid-1)/2];
    pcep  =  &ftp_cep[cepid-1];

    pftpstat->exec_command_subseq = FTP_DATA_RETR_SUBSEQ08;

    if (pftpstat->trans_mode == 'A')
    {
        /* ASCII mode */
        readsize = file_read(pftpstat->file_index, pcep->buff_ptr + DATA_BUF_SIZE / 2, DATA_BUF_SIZE / 2);
        if (readsize < 0)
        {
            file_close(pftpstat->file_index);
            pftpstat->exec_command_subseq = FTP_DATA_SUBSEQ_ERR;
            return -1;
        }

        if (readsize == 0)
        {
            flag = pftpstat->read_crlf_check;
            if (flag == 1)
            {
                /* flag == ON : last one character of data read ahead == 0x0d */
                sizeret = 1;
                pcep->buff_ptr[0] = 0x0a;
                flag = 0;
            }
            else
            {
                /* flag == OFF : last one character of data read ahead != 0x0d */
                file_close(pftpstat->file_index);
                pftpstat->exec_command_subseq = FTP_DATA_RETR_SUBSEQ12;
                sizeret = 0;
            }
        }
        else
        {

            flag =  pftpstat->read_crlf_check;
            for (i = 0, sizeret = 0; i < readsize; i++)
            {
                switch (pcep->buff_ptr[DATA_BUF_SIZE/2 + i])
                {
                    case 0x0d:
                        if (flag == 1)
                        {
                            /* ... 0x0d, 0x0d */
                            pcep->buff_ptr[sizeret++] = 0x0a;
                        }
                        flag = 1;
                        break;
                    case 0x0a:
                        if (flag != 1)
                        {
                            /* ...  not 0x0d, 0x0a */
                            pcep->buff_ptr[sizeret++] = 0x0d;
                        }
                        flag = 0;
                        break;
                    default:
                        if (flag == 1)
                        {
                            /* ... 0x0d, 0xXX */
                            pcep->buff_ptr[sizeret++] = 0x0a;
                        }
                        flag = 0;
                        break;
                }
                pcep->buff_ptr[sizeret++] = pcep->buff_ptr[DATA_BUF_SIZE/2 + i];
            }
        }
        pftpstat->read_crlf_check = flag;
        pcep->remain_data = sizeret;

    }
    else
    {
        /* BINARY mode */
        readsize = file_read(pftpstat->file_index, pcep->buff_ptr, DATA_BUF_SIZE);
        if (readsize < 0)
        {
            file_close(pftpstat->file_index);
            pftpstat->exec_command_subseq = FTP_DATA_SUBSEQ_ERR;
            return -1;
        }

        if (readsize == 0)
        {
            file_close(pftpstat->file_index);
            pftpstat->exec_command_subseq = FTP_DATA_RETR_SUBSEQ12;
        }

        pcep->remain_data = readsize;

    }


    return pcep->remain_data;
}


static int16_t ftps_retr_finish(ID cepid)
{
    _FTP_STAT *pftpstat;
    FTP_CEP   *pcep;

    pftpstat =  &ftp_stat[(cepid-1)/2];
    pcep  =  &ftp_cep[cepid-1];

    if (pftpstat->exec_command_subseq != FTP_DATA_RETR_SUBSEQ16)
    {
        pcep->remain_data = sprintf((char *)(pcep->buff_ptr), MSG_EXEC_ERROR);
    }
    else
    {
        pcep->remain_data = sprintf((char *)(pcep->buff_ptr), MSG_TRNS_CMPLT);
    }

    pftpstat->exec_command = FTP_DATA_NONE;
    pftpstat->exec_command_subseq = 0;

    pcep->remain_data = strlen((const char *)pcep->buff_ptr);

    return (0);
}


static int16_t ftps_stor(int16_t argc, int8_t **argv, ID cepid)
{
    int32_t file_index;
    _FTP_STAT *pftpstat;
    FTP_CEP   *pcep;
    uint8_t  tmp_buf[512];

    pftpstat =  &ftp_stat[(cepid-1)/2];
    pcep  =  &ftp_cep[cepid-1];

    pftpstat->rnfr = 0;
    if (pcep->status < FTP_LOGIN)
    {
        pcep->remain_data = sprintf((char *)(pcep->buff_ptr), MSG_NOT_AVAILABLE);
        pcep->status = FTP_CLOSING;
        return (-1);
    }

    pftpstat->exec_command = FTP_DATA_STOR;
    pftpstat->exec_command_subseq = FTP_DATA_STOR_SUBSEQ04;

    if (argc != 2)
    {
        pcep->remain_data = sizeof(MSG_PARAM_ERROR) - 1;
        strcpy((char *)(pcep->buff_ptr), MSG_PARAM_ERROR);
        pftpstat->exec_command_subseq = FTP_DATA_SUBSEQ_ERR;
        return -1;
    }

    strcpy((char *)(pftpstat->fname), (const char *)argv[1]);

    if (0 != path_concatenate(cepid , tmp_buf, sizeof(tmp_buf), (uint8_t *)argv[1]))
    {
        pcep->remain_data = sizeof(MSG_EXEC_ERROR) - 1;
        strcpy((char *)(pcep->buff_ptr), MSG_EXEC_ERROR);
        return -1;
    }

    file_index = file_open((uint8_t *)tmp_buf, FILE_WRITE);
    if (file_index < 0)
    {
        pcep->remain_data = sizeof(MSG_NO_SUCH_FILE) - 1;
        strcpy((char *)(pcep->buff_ptr), MSG_NO_SUCH_FILE);
        pftpstat->exec_command_subseq = FTP_DATA_SUBSEQ_ERR;
        return -1;
    }
    else
    {
        pftpstat->file_index = file_index;
        if (pftpstat->trans_mode == 'A')
        {
            pcep->remain_data = sprintf((char *)(pcep->buff_ptr), MSG_OPEN_DATA_CON, "ASCII");
        }
        else
        {
            pcep->remain_data = sprintf((char *)(pcep->buff_ptr), MSG_OPEN_DATA_CON, "IMAGE");
        }
    }

    return (0);
}


static int16_t ftps_stor_dataport(ID cepid, int32_t rcv_len)
{
    _FTP_STAT *pftpstat;
    FTP_CEP   *pcep;

    pftpstat =  &ftp_stat[(cepid-1)/2];
    pcep  =  &ftp_cep[cepid-1];

    if (file_write(pftpstat->file_index, pcep->buff_ptr, rcv_len) < 0)
    {
        file_close(pftpstat->file_index);
        pftpstat->exec_command_subseq = FTP_DATA_SUBSEQ_ERR;
        return -1;
    }
    return 0;
}


static int16_t ftps_stor_finish(ID cepid)
{
    _FTP_STAT *pftpstat;
    FTP_CEP   *pcep;

    pftpstat =  &ftp_stat[(cepid-1)/2];
    pcep  =  &ftp_cep[cepid-1];

