renesas-rx/rx65n-envision-kit/rx65n_envisionkit/benchmark/rx65n_envision_kit_demo/src/smc_gen/r_t4_ftp_server_rx/src/r_ftp_server.c
    if (pftpstat->exec_command_subseq != FTP_DATA_STOR_SUBSEQ04)
    {
        pcep->remain_data = sprintf((char *)(pcep->buff_ptr), MSG_EXEC_ERROR);
    }
    else
    {
        pcep->remain_data = sprintf((char *)(pcep->buff_ptr), MSG_TRNS_CMPLT);
    }

    pftpstat->exec_command = FTP_DATA_NONE;
    pftpstat->exec_command_subseq = 0;

    pcep->remain_data = strlen((const char *)pcep->buff_ptr);

    return (0);
}


static int16_t ftps_mkd(int16_t argc, int8_t **argv, ID cepid)
{
    int32_t ret;
    uint8_t tmp_path[256];

    ftp_stat[(cepid-1)/2].rnfr = 0;
    if (ftp_cep[cepid-1].status < FTP_LOGIN)
    {
        ftp_cep[cepid-1].remain_data = sprintf((char *)(ftp_cep[cepid-1].buff_ptr), MSG_NOT_AVAILABLE);
        ftp_cep[cepid-1].status = FTP_CLOSING;
        return (-1);
    }
    if (argc != 2)
    {
        ftp_cep[cepid-1].remain_data = sizeof(MSG_PARAM_ERROR) - 1;
        strcpy((char *)(ftp_cep[cepid-1].buff_ptr), MSG_PARAM_ERROR);
        return -1;
    }

    if (0 != path_concatenate(cepid , tmp_path, sizeof(tmp_path), (uint8_t *)argv[1]))
    {
        ftp_cep[cepid-1].remain_data = sizeof(MSG_EXEC_ERROR) - 1;
        strcpy((char *)(ftp_cep[cepid-1].buff_ptr), MSG_EXEC_ERROR);
        return -1;
    }

    ret = make_dir((uint8_t*)tmp_path);
    switch (ret)
    {
        case -1:
            ftp_cep[cepid-1].remain_data = sizeof(MSG_INVALID_PATH) - 1;
            strcpy((char *)(ftp_cep[cepid-1].buff_ptr), MSG_INVALID_PATH);
            break;
        default:
            ftp_cep[cepid-1].remain_data = sizeof(MSG_MKD_RESPONSE) - 1;
            strcpy((char *)(ftp_cep[cepid-1].buff_ptr), MSG_MKD_RESPONSE);
            break;
    }
    return (0);
}


static int16_t ftps_cwd(int16_t argc, int8_t **argv, ID cepid)
{
    int32_t ret;
    uint8_t tmp_path[256];
    uint8_t cmdname[5];
    int32_t len;

    ftp_stat[(cepid-1)/2].rnfr = 0;
    if (ftp_cep[cepid-1].status < FTP_LOGIN)
    {
        ftp_cep[cepid-1].remain_data = sprintf((char *)(ftp_cep[cepid-1].buff_ptr), MSG_NOT_AVAILABLE);
        ftp_cep[cepid-1].status = FTP_CLOSING;
        return (-1);
    }
    if (argc != 2)
    {
        ftp_cep[cepid-1].remain_data = sizeof(MSG_PARAM_ERROR) - 1;
        strcpy((char *)(ftp_cep[cepid-1].buff_ptr), MSG_PARAM_ERROR);
        return -1;
    }

    strcpy((char *)cmdname, (const char *)argv[0]);

    if (0 != path_concatenate(cepid , tmp_path, sizeof(tmp_path), (uint8_t *)argv[1]))
    {
        ftp_cep[cepid-1].remain_data = sizeof(MSG_EXEC_ERROR) - 1;
        strcpy((char *)(ftp_cep[cepid-1].buff_ptr), MSG_EXEC_ERROR);
        return -1;
    }

    len = strlen((char *)tmp_path);
    if (len > 1 && tmp_path[len-1] == '/')
    {
        tmp_path[len-1] = '\0';
    }

    ret = change_dir(tmp_path);
    if (ret == 0)
    {
        ftp_cep[cepid-1].remain_data = sprintf((char *)(ftp_cep[cepid-1].buff_ptr), MSG_CMD_SUCCESS, cmdname);
        strcpy((char *)(ftp_stat[(cepid-1)/2].current_path), (const char *)tmp_path);

    }
    else
    {
        ftp_cep[cepid-1].remain_data = sizeof(MSG_INVALID_PATH) - 1;
        strcpy((char *)(ftp_cep[cepid-1].buff_ptr), MSG_INVALID_PATH);
    }


    return ret;
}


static int16_t ftps_cdup(int16_t argc, int8_t **argv, ID cepid)
{
    uint8_t tmp_path[256];
    uint8_t cmdname[5];
    uint16_t len, loop;

    ftp_stat[(cepid-1)/2].rnfr = 0;
    if (ftp_cep[cepid-1].status < FTP_LOGIN)
    {
        ftp_cep[cepid-1].remain_data = sprintf((char *)(ftp_cep[cepid-1].buff_ptr), MSG_NOT_AVAILABLE);
        ftp_cep[cepid-1].status = FTP_CLOSING;
        return (-1);
    }

    strcpy((char *)cmdname, (const char *)argv[0]);

    strcpy((char *)tmp_path, (char *)(ftp_stat[(cepid-1)/2].current_path));
    if (strlen((char *)(ftp_stat[(cepid-1)/2].current_path)) == 1)
    {
        ftp_cep[cepid-1].remain_data = sizeof(MSG_INVALID_PATH) - 1;
        strcpy((char *)(ftp_cep[cepid-1].buff_ptr), MSG_INVALID_PATH);
    }
    else
    {
        len = strlen((char*)tmp_path);
        for (loop = len;loop > 0; loop--)
        {
            if (tmp_path[loop] == '/')
            {
                tmp_path[loop] = 0;
                break;
            }
            else
            {
                tmp_path[loop] = 0;
            }
        }
        ftp_cep[cepid-1].remain_data = sprintf((char *)(ftp_cep[cepid-1].buff_ptr), MSG_CMD_SUCCESS, cmdname);
        strcpy((char *)(ftp_stat[(cepid-1)/2].current_path), (const char *)tmp_path);
    }

    return (0);
}


static int16_t ftps_dele(int16_t argc, int8_t **argv, ID cepid)
{
    uint8_t tmp_path[256];
    uint8_t cmdname[5];

    ftp_stat[(cepid-1)/2].rnfr = 0;
    if (ftp_cep[cepid-1].status < FTP_LOGIN)
    {
        ftp_cep[cepid-1].remain_data = sprintf((char *)(ftp_cep[cepid-1].buff_ptr), MSG_NOT_AVAILABLE);
        ftp_cep[cepid-1].status = FTP_CLOSING;
        return (-1);
    }
    if (argc != 2)
    {
        ftp_cep[cepid-1].remain_data = sizeof(MSG_PARAM_ERROR) - 1;
        strcpy((char *)(ftp_cep[cepid-1].buff_ptr), MSG_PARAM_ERROR);
        return -1;
    }

    strcpy((char *)cmdname, (const char *)argv[0]);

    if (0 != path_concatenate(cepid , tmp_path, sizeof(tmp_path), (uint8_t *)argv[1]))
    {
        ftp_cep[cepid-1].remain_data = sizeof(MSG_EXEC_ERROR) - 1;
        strcpy((char *)(ftp_cep[cepid-1].buff_ptr), MSG_EXEC_ERROR);
        return -1;
    }


    if (file_delete((uint8_t *)tmp_path) == 0)
    {
        ftp_cep[cepid-1].remain_data = sprintf((char *)(ftp_cep[cepid-1].buff_ptr), MSG_CMD_SUCCESS, cmdname);
        return (0);
    }
    else
    {
        ftp_cep[cepid-1].remain_data = sizeof(MSG_INVALID_PATH) - 1;
        strcpy((char *)(ftp_cep[cepid-1].buff_ptr), MSG_INVALID_PATH);
        return (-1);
    }
}


static int16_t ftps_rmd(int16_t argc, int8_t **argv, ID cepid)
{
    int32_t ret;

    uint8_t tmp_path[256];

    ftp_stat[(cepid-1)/2].rnfr = 0;
    if (ftp_cep[cepid-1].status < FTP_LOGIN)
    {
        ftp_cep[cepid-1].remain_data = sprintf((char *)(ftp_cep[cepid-1].buff_ptr), MSG_NOT_AVAILABLE);
        ftp_cep[cepid-1].status = FTP_CLOSING;
        return (-1);
    }
    if (argc != 2)
    {
        ftp_cep[cepid-1].remain_data = sizeof(MSG_PARAM_ERROR) - 1;
        strcpy((char *)(ftp_cep[cepid-1].buff_ptr), MSG_PARAM_ERROR);
        return -1;
    }

    if (0 != path_concatenate(cepid , tmp_path, sizeof(tmp_path), (uint8_t *)argv[1]))
    {
        ftp_cep[cepid-1].remain_data = sizeof(MSG_EXEC_ERROR) - 1;
        strcpy((char *)(ftp_cep[cepid-1].buff_ptr), MSG_EXEC_ERROR);
        return -1;
    }

    ret = remove_dir((uint8_t *)tmp_path);
    switch (ret)
    {
        case -1:
            ftp_cep[cepid-1].remain_data = sizeof(MSG_INVALID_PATH) - 1;
            strcpy((char *)(ftp_cep[cepid-1].buff_ptr), MSG_INVALID_PATH);
            break;
        default:
            ftp_cep[cepid-1].remain_data = sizeof(MSG_MKD_RESPONSE) - 1;
            strcpy((char *)(ftp_cep[cepid-1].buff_ptr), MSG_MKD_RESPONSE);
            break;
    }
    return (0);
}


static int16_t ftps_rnfr(int16_t argc, int8_t **argv, ID cepid)
{
    uint8_t tmp_path[256];

    ftp_stat[(cepid-1)/2].rnfr = 0;
    if (ftp_cep[cepid-1].status < FTP_LOGIN)
    {
        ftp_cep[cepid-1].remain_data = sprintf((char *)(ftp_cep[cepid-1].buff_ptr), MSG_NOT_AVAILABLE);
        ftp_cep[cepid-1].status = FTP_CLOSING;
        return (-1);
    }
    if (argc != 2)
    {
        ftp_cep[cepid-1].remain_data = sizeof(MSG_PARAM_ERROR) - 1;
        strcpy((char *)(ftp_cep[cepid-1].buff_ptr), MSG_PARAM_ERROR);
        return -1;
    }


    if (0 != path_concatenate(cepid , tmp_path, sizeof(tmp_path), (uint8_t *)argv[1]))
    {
        ftp_cep[cepid-1].remain_data = sizeof(MSG_EXEC_ERROR) - 1;
        strcpy((char *)(ftp_cep[cepid-1].buff_ptr), MSG_EXEC_ERROR);
        return -1;
    }

