renesas-rx/rx65n-envision-kit/rx65n_envisionkit/benchmark/rx65n_envision_kit_demo/src/smc_gen/r_t4_ftp_server_rx/src/r_ftp_server.c
    if (file_exist((uint8_t *)tmp_path) == 0)
    {
        strcpy((char *)(ftp_stat[(cepid-1)/2].fname), (const char *)tmp_path);
        ftp_cep[cepid-1].remain_data = sizeof(MSG_RNFR_RES) - 1;
        strcpy((char *)(ftp_cep[cepid-1].buff_ptr), MSG_RNFR_RES);
        ftp_stat[(cepid-1)/2].rnfr = 1;
    }
    else
    {
        ftp_cep[cepid-1].remain_data = sizeof(MSG_INVALID_PATH) - 1;
        strcpy((char *)(ftp_cep[cepid-1].buff_ptr), MSG_INVALID_PATH);
    }
    return (0);
}


static int16_t ftps_rnto(int16_t argc, int8_t **argv, ID cepid)
{
    uint8_t old_path[256];
    uint8_t new_path[256];
    int8_t cmdname[5];

    if (ftp_cep[cepid-1].status < FTP_LOGIN)
    {
        ftp_cep[cepid-1].remain_data = sprintf((char *)(ftp_cep[cepid-1].buff_ptr), MSG_NOT_AVAILABLE);
        ftp_cep[cepid-1].status = FTP_CLOSING;
        ftp_stat[(cepid-1)/2].rnfr = 0;
        return (-1);
    }
    if (ftp_stat[(cepid-1)/2].rnfr != 1)
    {
        ftp_cep[cepid-1].remain_data = sprintf((char *)(ftp_cep[cepid-1].buff_ptr), MSG_CMD_BAD_SEQ);
        return (-1);
    }
    if (argc != 2)
    {
        ftp_cep[cepid-1].remain_data = sizeof(MSG_PARAM_ERROR) - 1;
        strcpy((char *)(ftp_cep[cepid-1].buff_ptr), MSG_PARAM_ERROR);
        return -1;
    }

    strcpy((char *)cmdname, (const char *)argv[0]);

    ftp_stat[(cepid-1)/2].rnfr = 0;

    if (0 != path_concatenate(cepid , new_path, sizeof(new_path), (uint8_t *)argv[1]))
    {
        ftp_cep[cepid-1].remain_data = sizeof(MSG_EXEC_ERROR) - 1;
        strcpy((char *)(ftp_cep[cepid-1].buff_ptr), MSG_EXEC_ERROR);
        return -1;
    }

    if (0 != path_concatenate(cepid , old_path, sizeof(old_path), (uint8_t *)ftp_stat[(cepid-1)/2].fname))
    {
        ftp_cep[cepid-1].remain_data = sizeof(MSG_EXEC_ERROR) - 1;
        strcpy((char *)(ftp_cep[cepid-1].buff_ptr), MSG_EXEC_ERROR);
        return -1;
    }

    if (file_rename((uint8_t *)old_path, (uint8_t *)new_path) == 0)
    {
        ftp_cep[cepid-1].remain_data = sprintf((char *)(ftp_cep[cepid-1].buff_ptr), MSG_CMD_SUCCESS, cmdname);
    }
    else
    {
        ftp_cep[cepid-1].remain_data = sizeof(MSG_INVALID_PATH) - 1;
        strcpy((char *)(ftp_cep[cepid-1].buff_ptr), MSG_INVALID_PATH);
    }
    return 0;
}


static int16_t ftps_abor(int16_t argc, int8_t **argv, ID cepid)
{

    _FTP_STAT *pftpstat;
    FTP_CEP   *cmd_pcep;
    FTP_CEP   *data_pcep;

    pftpstat  =  &ftp_stat[(cepid-1)/2];
    cmd_pcep  =  &ftp_cep[cepid-1];
    data_pcep  =  &ftp_cep[cepid];

    pftpstat->rnfr = 0;
    if (cmd_pcep->status < FTP_LOGIN)
    {
        cmd_pcep->remain_data = sprintf((char *)(cmd_pcep->buff_ptr), MSG_NOT_AVAILABLE);
        cmd_pcep->status = FTP_CLOSING;
        return (-1);
    }

    /* analyze FTP server status to judge which API(T4) should be canceled */
    if (pftpstat->exec_command != FTP_DATA_NONE)
    {
        cmd_pcep->api_cancel = 0;
        cmd_pcep->remain_data = sprintf((char *)(cmd_pcep->buff_ptr), MSG_ABORT);
        switch (pftpstat->exec_command)
        {
            case FTP_DATA_LIST:
                break;
            case FTP_DATA_RETR:
            case FTP_DATA_STOR:
                file_close(pftpstat->file_index);
                break;
        }
        pftpstat->exec_command = FTP_DATA_ABOR;
        pftpstat->exec_command_subseq = FTP_DATA_ABOR_SUBSEQ04;

        if (data_pcep->status != FTP_CLOSED)
        {
            /* ftpstat == (command processing && establised */
            data_pcep->api_cancel = 1;
            return 3;
        }
        else
        {
            /* ftpstat == (command processing && closed) */
            pftpstat->exec_command_subseq = FTP_DATA_ABOR_SUBSEQ08;
            cmd_pcep->remain_data = sprintf((char *)(cmd_pcep->buff_ptr), MSG_ABORT);
            return 2;
        }
    }
    else if (data_pcep->status > FTP_CLOSING)
    {
        /* ftpstat == (not in command processing && (established) */
        cmd_pcep->remain_data = sprintf((char *)(cmd_pcep->buff_ptr), MSG_TRNS_CMPLT);
        return 1;
    }
    else
    {
        /* ftpstat == (not in command processing && (closed || closing)) */
        cmd_pcep->remain_data = sprintf((char *)(cmd_pcep->buff_ptr), MSG_TRNS_CMPLT);
        return 0;
    }
}


static void ftps_abor_finish(ID cepid)
{
    _FTP_STAT *pftpstat;
    FTP_CEP   *cmd_pcep;

    pftpstat  =  &ftp_stat[(cepid-1)/2];
    cmd_pcep  =  &ftp_cep[cepid-1];

    switch (pftpstat->exec_command_subseq)
    {
        case FTP_DATA_ABOR_SUBSEQ04:
            cmd_pcep->remain_data = sprintf((char *)(cmd_pcep->buff_ptr), MSG_ABORT);
            pftpstat->exec_command_subseq = FTP_DATA_ABOR_SUBSEQ08;
            break;
        case FTP_DATA_ABOR_SUBSEQ08:
            cmd_pcep->remain_data = sprintf((char *)(cmd_pcep->buff_ptr), MSG_TRNS_CMPLT);
            pftpstat->exec_command = FTP_DATA_NONE;
            pftpstat->exec_command_subseq = 0;
            break;
    }
}



static int16_t non_support_cmd(ID cepid, int8_t *argv)
{
    uint8_t cmdname[256];

    ftp_stat[(cepid-1)/2].rnfr = 0;

    strncpy((char *)cmdname, (const char *)argv, 256);
    cmdname[sizeof(cmdname)-1] = '\0';
    ftp_cep[cepid-1].remain_data = sprintf((char *)(ftp_cep[cepid-1].buff_ptr), MSG_CMD_FAILED, cmdname);
    return(-1);
}


static int32_t stricmp_rx(const uint8_t *s1, const uint8_t *s2, int32_t count)
{
    int32_t ret_i;
    int8_t c1, c2;
    int32_t loop;

    ret_i = 0;
    for (loop = 0; loop < count; loop++)
    {
        c1 = (int8_t)tolower(*(s1 + loop));
        c2 = (int8_t)tolower(*(s2 + loop));
        ret_i = c1 - c2;
        if (ret_i != 0)
        {
            break;
        }
        if (c1 == '\0')
        {
            break;
        }
    }
    return ret_i;

}

static int32_t path_concatenate(ID cepid , uint8_t *buf, uint32_t buf_len, uint8_t *path)
{
    int32_t  ret;
    _FTP_STAT *pftpstat;

