renesas-rx/rx65n-envision-kit/rx65n_envisionkit/benchmark/rx65n_envision_kit_demo/src/smc_gen/r_t4_ftp_server_rx/src/r_ftp_server.c
    pftpstat = (&ftp_stat[(cepid-1)/2]);

    ret = 0;
    buf[0] = '\0';
    if (path[0] != '/')
    {
        /* current path + file/folder name */
        ret |= strcat_with_check_len(buf, (uint8_t *)pftpstat->current_path, buf_len);
        if (buf[strlen((char *)buf)-1] != '/')
        {
            ret |= strcat_with_check_len(buf, "/", buf_len);
        }
    }
    ret |= strcat_with_check_len(buf, path, buf_len);
    return ret;
}

ER ftp_callback(ID cepid, FN fncd , VP p_parblk)
{

    ER   parblk = *(ER *)p_parblk;
    ER   ercd;
    int16_t   func_ret;
    int16_t   argc;
    int8_t   *argv[MAX_ARGC];
    int32_t  ret;
    int16_t  i;
    int8_t   **p_cmd;

    ID   cmd_cepid;
    ID   data_cepid;
    FTP_CEP   *cmd_pcep;
    FTP_CEP   *data_pcep;
    _FTP_STAT *pftpstat;
    ID   cmd_cepid_oft;
    ID   data_cepid_oft;

    if (0 != (FTP_START_TCP_CEP % 2))
    {
        while (1); /* System Error !! */
    }

    if (cepid > FTP_START_TCP_CEP)
    {
        cmd_cepid_oft = cepid - FTP_START_TCP_CEP;
        data_cepid_oft = cmd_cepid_oft + 1;
    }
    else /* if (cepid > FTP_START_TCP_CEP) */
    {
        while (1);  /* System error !! */
    }

    cmd_cepid  = (cepid);
    data_cepid = (cepid + 1);
    cmd_pcep   = (&ftp_cep[cmd_cepid_oft-1]);
    data_pcep  = (&ftp_cep[data_cepid_oft-1]);
    pftpstat   = (&ftp_stat[(cmd_cepid_oft-1)/2]);

    if (parblk == E_RLWAI)
    {
        if (pftpstat->cep_reset_req == 0)
        {
            cmd_pcep->api_cancel = 0;
            switch (pftpstat->exec_command)
            {
                case FTP_DATA_LIST:
                    ftps_list_nlst_finish(cmd_cepid_oft);
                    tcp_snd_dat(cmd_cepid, (VP)cmd_pcep->buff_ptr, cmd_pcep->remain_data, TMO_NBLK);
                    break;
                case FTP_DATA_STOR:
                    ftps_stor_finish(cmd_cepid_oft);
                    tcp_snd_dat(cmd_cepid, (VP)cmd_pcep->buff_ptr, cmd_pcep->remain_data, TMO_NBLK);
                    break;
                case FTP_DATA_RETR:
                    ftps_retr_finish(cmd_cepid_oft);
                    tcp_snd_dat(cmd_cepid, (VP)cmd_pcep->buff_ptr, cmd_pcep->remain_data, TMO_NBLK);
                    break;
            }
        }
        else
        {
            pftpstat->cep_reset_req |= 0x04;
        }
        return 0;
    }
    if (parblk < 0)
    {
        cmd_pcep->now_data = 0;
        cmd_pcep->remain_data = 0;
        pftpstat->cep_reset_req = 0x10;
        return 0;
    }
    if (pftpstat->cep_reset_req > 0)
    {
        return 0;
    }
    switch (fncd)
    {
        case TFN_TCP_ACP_CEP:
            cmd_pcep->status = FTP_CONNECTION;
            cmd_pcep->remain_data = sprintf((char *)(cmd_pcep->buff_ptr), MSG_SERVER_READY);
            cmd_pcep->now_data = 0;
            tcp_snd_dat(cmd_cepid, cmd_pcep->buff_ptr, cmd_pcep->remain_data, TMO_NBLK);
            break;
        case TFN_TCP_SND_DAT:
            cmd_pcep->now_data += parblk;
            cmd_pcep->remain_data -= parblk;
            if (cmd_pcep->remain_data > 0)
            {
                tcp_snd_dat(cmd_cepid, (VP)(cmd_pcep->buff_ptr + cmd_pcep->now_data), data_pcep->remain_data, TMO_NBLK);
                break;
            }

            cmd_pcep->now_data = 0;

            if (cmd_pcep->status == FTP_CLOSING)
            {
                tcp_cls_cep(cmd_cepid, TMO_NBLK);
                break;
            }
            if (pftpstat->exec_command != FTP_DATA_NONE)
            {
                switch (pftpstat->exec_command)
                {
                    case FTP_DATA_LIST:
                        ret = ftps_list_nlst_dataport(data_cepid_oft);
                        if (ret < 0)
                        {
                            /* error */
                            tcp_cls_cep(data_cepid, TMO_NBLK);
                            data_pcep->status = FTP_CLOSING;
                        }
                        else if (ret > 0)
                        {
                            tcp_snd_dat(data_cepid, (VP)(data_pcep->buff_ptr), data_pcep->remain_data, TMO_NBLK);
                        }
                        else
                        {
                            /* There is no more send data. */
                            tcp_cls_cep(data_cepid, TMO_NBLK);
                            data_pcep->status = FTP_CLOSING;
                        }
                        tcp_rcv_dat(cmd_cepid, cmd_pcep->buff_ptr, CMD_BUF_SIZE, TMO_NBLK);
                        break;
                    case FTP_DATA_STOR:
                        tcp_rcv_dat(cmd_cepid, cmd_pcep->buff_ptr, CMD_BUF_SIZE, TMO_NBLK);
                        break;
                    case FTP_DATA_RETR:
                        ret = ftps_retr_dataport(data_cepid_oft);
                        if (ret < 0)
                        {
                            /* error */
                            tcp_cls_cep(data_cepid, TMO_NBLK);
                            data_pcep->status = FTP_CLOSING;
                        }
                        else if (ret > 0)
                        {
                            tcp_snd_dat(data_cepid, (VP)(data_pcep->buff_ptr), data_pcep->remain_data, TMO_NBLK);
                        }
                        else
                        {
                            /* There is no more send data. */
                            tcp_cls_cep(data_cepid, TMO_NBLK);
                            data_pcep->status = FTP_CLOSING;
                        }
                        tcp_rcv_dat(cmd_cepid, cmd_pcep->buff_ptr, CMD_BUF_SIZE, TMO_NBLK);
                        break;
                    case FTP_DATA_ABOR:
                        ftps_abor_finish(cmd_cepid_oft);
                        tcp_snd_dat(cmd_cepid, (VP)cmd_pcep->buff_ptr, cmd_pcep->remain_data, TMO_NBLK);
                        break;
                    default:
                        break;
                }
                break;
            }
            tcp_rcv_dat(cmd_cepid, cmd_pcep->buff_ptr, CMD_BUF_SIZE, TMO_NBLK);
            break;
        case TFN_TCP_RCV_DAT:
            if (parblk == 0)
            {
                cmd_pcep->now_data = 0;
                tcp_cls_cep(cmd_cepid, TMO_NBLK);
                cmd_pcep->status = FTP_CLOSING;
                break;
            }
            /* The reception of the command: Return value -1: Error 0: Completion 1: There are continuation data  */
            ercd = ftp_rcv_request(cmd_cepid_oft, cmd_pcep->buff_ptr, CMD_BUF_SIZE, *(ER *)p_parblk);

